In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(data= my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
ser1=pd.Series([1,2,3,4],index=['USA','GERMANY','USSR','JAPAN'])

In [8]:
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [9]:
ser2=pd.Series([1,2,3,4],index=['USA','GERMANY','ITALY','JAPAN'])

In [10]:
ser2

USA        1
GERMANY    2
ITALY      3
JAPAN      4
dtype: int64

In [11]:
ser1['USA']

1

In [12]:
ser1+ser2

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
from numpy.random import randn
np.random.seed(101)

In [14]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [18]:
from numpy.random import randn
np.random.seed(101)

In [19]:
df=pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z M'.split())

In [20]:
df

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [21]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B -0.319318 -2.018168
C  0.528813 -0.758872
D  0.955057  2.605967
E  0.302665 -1.159119

In [22]:
df.W

A    2.706850
B   -0.319318
C    0.528813
D    0.955057
E    0.302665
Name: W, dtype: float64

In [23]:
df[['Y','W']]

          Y         W
A  0.907969  2.706850
B  0.605965 -0.319318
C  0.188695  0.528813
D  1.978757  0.955057
E -1.706086  0.302665

In [24]:
df['Y']

A    0.907969
B    0.605965
C    0.188695
D    1.978757
E   -1.706086
Name: Y, dtype: float64

In [25]:
type(df['W'])

pandas.core.series.Series

In [26]:
df['new']=df['W']+df['Y']

In [27]:
df

          W         X         Y         Z         M       new
A  2.706850  0.628133  0.907969  0.503826  0.651118  3.614819
B -0.319318 -0.848077  0.605965 -2.018168  0.740122  0.286647
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237  0.717509
D  0.955057  0.190794  1.978757  2.605967  0.683509  2.933814
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841 -1.403420

In [28]:
df.drop('new',axis=1)

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [29]:
df

          W         X         Y         Z         M       new
A  2.706850  0.628133  0.907969  0.503826  0.651118  3.614819
B -0.319318 -0.848077  0.605965 -2.018168  0.740122  0.286647
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237  0.717509
D  0.955057  0.190794  1.978757  2.605967  0.683509  2.933814
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841 -1.403420

In [30]:
df.drop('new',axis=1,inplace=True)

In [31]:
df

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [32]:
df.drop('E',axis=0)

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [33]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
M    0.651118
Name: A, dtype: float64

In [34]:
df.iloc[2]

W    0.528813
X   -0.589001
Y    0.188695
Z   -0.758872
M   -0.933237
Name: C, dtype: float64

In [35]:
df.loc['B','Y']

0.6059653494949336

In [36]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B -0.319318  0.605965

In [37]:
df.iloc[:]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [38]:
df

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [39]:
df>0

       W      X      Y      Z      M
A   True   True   True   True   True
B  False  False   True  False   True
C   True  False   True  False  False
D   True   True   True   True   True
E   True   True  False  False  False

In [40]:
df[df>0]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B       NaN       NaN  0.605965       NaN  0.740122
C  0.528813       NaN  0.188695       NaN       NaN
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723       NaN       NaN       NaN

In [41]:
df[df['W']>0]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [42]:
df[df["Y"]>0]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['Z']>0]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [44]:
df[df['X']>0]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [45]:
df[df['M']>0]

          W         X         Y         Z         M
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [46]:
df[df['W']>0]['Y']

A    0.907969
C    0.188695
D    1.978757
E   -1.706086
Name: Y, dtype: float64

In [47]:
df[df['Y']>0]['Z']

A    0.503826
B   -2.018168
C   -0.758872
D    2.605967
Name: Z, dtype: float64

In [48]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
C  0.188695 -0.589001
D  1.978757  0.190794
E -1.706086  1.693723

In [49]:
df[df['Y']>0][['Z','M']]

          Z         M
A  0.503826  0.651118
B -2.018168  0.740122
C -0.758872 -0.933237
D  2.605967  0.683509

In [50]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z         M
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [51]:
df.reset_index()

  index         W         X         Y         Z         M
0     A  2.706850  0.628133  0.907969  0.503826  0.651118
1     B -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     D  0.955057  0.190794  1.978757  2.605967  0.683509
4     E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [52]:
newind = 'CA NY WY OR CO'.split()

In [53]:
df['States'] = newind

In [54]:
df

          W         X         Y         Z         M States
A  2.706850  0.628133  0.907969  0.503826  0.651118     CA
B -0.319318 -0.848077  0.605965 -2.018168  0.740122     NY
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237     WY
D  0.955057  0.190794  1.978757  2.605967  0.683509     OR
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841     CO

In [55]:
df.set_index('States')

               W         X         Y         Z         M
States
CA      2.706850  0.628133  0.907969  0.503826  0.651118
NY     -0.319318 -0.848077  0.605965 -2.018168  0.740122
WY      0.528813 -0.589001  0.188695 -0.758872 -0.933237
OR      0.955057  0.190794  1.978757  2.605967  0.683509
CO      0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [56]:
df

          W         X         Y         Z         M States
A  2.706850  0.628133  0.907969  0.503826  0.651118     CA
B -0.319318 -0.848077  0.605965 -2.018168  0.740122     NY
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237     WY
D  0.955057  0.190794  1.978757  2.605967  0.683509     OR
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841     CO

In [57]:
df.set_index('States',inplace=True)

In [58]:
df

               W         X         Y         Z         M
States
CA      2.706850  0.628133  0.907969  0.503826  0.651118
NY     -0.319318 -0.848077  0.605965 -2.018168  0.740122
WY      0.528813 -0.589001  0.188695 -0.758872 -0.933237
OR      0.955057  0.190794  1.978757  2.605967  0.683509
CO      0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [59]:
df.to_csv('example')

In [60]:
data=pd.read_csv('example')

In [61]:
data

  States         W         X         Y         Z         M
0     CA  2.706850  0.628133  0.907969  0.503826  0.651118
1     NY -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     WY  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     OR  0.955057  0.190794  1.978757  2.605967  0.683509
4     CO  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [3]:
data=pd.read_csv('dataframe.xls')
data

NameError: name 'pd' is not defined